[
    {
        "name": "Aspirin",
        "description": "Aspirin is a nonsteroidal anti-inflammatory drug (NSAID) that is commonly used to reduce pain, fever, and inflammation. It works by blocking the production of certain chemicals in the body that cause pain and inflammation. Aspirin is often used to treat conditions like headache, menstrual cramps, toothache, and arthritis. It is also used as a blood thinner to prevent heart attacks and strokes in people who are at risk.",
        "id": "aecbacebe234",
        "price": "Rs. 30",
        "prevPrice": "Rs. 45",
        "dosage": "325-650 mg every 4-6 hours as needed",
        "side_effects": ["Nausea", "Vomiting", "Stomach pain", "Bleeding", "Allergic reactions"]
    },
    {
        "name": "Paracetamol",
        "description": "Paracetamol, also known as acetaminophen, is a widely used medication to relieve pain and reduce fever. It works by increasing the pain threshold and lowering the body's temperature set-point. Paracetamol is commonly used to treat conditions such as headaches, toothaches, menstrual cramps, and mild arthritis. It is a safe and effective over-the-counter medication.",
        "id": "bcddeaf67d1",
        "price": "Rs. 25",
        "prevPrice": "Rs. 35",
        "dosage": "500-1000 mg every 4-6 hours as needed",
        "side_effects": [
            "Nausea",
            "Skin rash",
            "Liver damage (in excessive doses)",
            "Allergic reactions"
        ]
    },
    {
        "name": "Ibuprofen",
        "description": "Ibuprofen is a nonsteroidal anti-inflammatory drug (NSAID) that is used to relieve pain, reduce inflammation, and lower fever. It works by inhibiting the production of prostaglandins, which are responsible for pain and inflammation. Ibuprofen is commonly used to treat conditions such as arthritis, back pain, menstrual cramps, and sports injuries.",
        "id": "7aee6cc3312",
        "price": "Rs. 35",
        "prevPrice": "Rs. 50",
        "dosage": "200-400 mg every 4-6 hours as needed",
        "side_effects": [
            "Stomach upset",
            "Heartburn",
            "Dizziness",
            "Ringing in the ears",
            "Allergic reactions"
        ]
    },
    {
        "name": "Loratadine",
        "description": "Loratadine is an antihistamine that is used to relieve allergy symptoms such as sneezing, runny nose, itching, and watery eyes. It works by blocking the action of histamine, a chemical produced by the body during allergic reactions. Loratadine provides long-lasting relief from seasonal and perennial allergies.",
        "id": "13aef45a834",
        "price": "Rs. 40",
        "prevPrice": "Rs. 60",
        "dosage": "10 mg once daily",
        "side_effects": ["Headache", "Dry mouth", "Drowsiness", "Nausea", "Allergic reactions"]
    },
    {
        "name": "Omeprazole",
        "description": "Omeprazole belongs to a class of medications known as proton pump inhibitors (PPIs). It is used to reduce the production of stomach acid and is commonly prescribed to treat conditions such as acid reflux, gastroesophageal reflux disease (GERD), and peptic ulcers. Omeprazole provides relief from heartburn and helps in the healing of damaged esophageal tissue.",
        "id": "c43abc56f90",
        "price": "Rs. 50",
        "prevPrice": "Rs. 75",
        "dosage": "20-40 mg once daily before a meal",
        "side_effects": ["Headache", "Nausea", "Diarrhea", "Abdominal pain", "Allergic reactions"]
    },
    {
        "name": "Cetirizine",
        "description": "Cetirizine is an antihistamine that is used to relieve allergy symptoms such as sneezing, itching, watery eyes, and runny nose. It works by blocking the action of histamine, a chemical produced by the body during allergic reactions. Cetirizine provides fast-acting and long-lasting relief from seasonal and perennial allergies.",
        "id": "abef3e45512",
        "price": "Rs. 45",
        "prevPrice": "Rs. 65",
        "dosage": "10 mg once daily",
        "side_effects": [
            "Drowsiness (in some individuals)",
            "Dry mouth",
            "Headache",
            "Nausea",
            "Allergic reactions"
        ]
    },
    {
        "name": "Simvastatin",
        "description": "Simvastatin is a medication used to lower cholesterol levels in the blood. It belongs to a class of drugs called statins, which work by inhibiting an enzyme involved in cholesterol production. Simvastatin is prescribed to reduce the risk of heart disease and stroke in individuals with high cholesterol levels.",
        "id": "acaf45b987c",
        "price": "Rs. 60",
        "prevPrice": "Rs. 90",
        "dosage": "10-40 mg once daily in the evening",
        "side_effects": [
            "Muscle pain",
            "Liver problems (rare)",
            "Digestive issues",
            "Headache",
            "Allergic reactions"
        ]
    },
    {
        "name": "Metformin",
        "description": "Metformin is an oral antidiabetic drug that is used to manage high blood sugar levels in people with type 2 diabetes. It works by reducing the amount of glucose produced by the liver and increasing the body's sensitivity to insulin. Metformin helps in controlling blood sugar levels and is often prescribed alongside lifestyle changes for diabetes management.",
        "id": "cafe456bc76",
        "price": "Rs. 70",
        "prevPrice": "Rs. 100",
        "dosage": "500-2000 mg per day, divided into two doses",
        "side_effects": [
            "Nausea",
            "Diarrhea",
            "Abdominal discomfort",
            "Metallic taste in the mouth",
            "Allergic reactions"
        ]
    },
    {
        "name": "Amoxicillin",
        "description": "Amoxicillin is a penicillin-type antibiotic used to treat bacterial infections. It works by stopping the growth of bacteria and is commonly prescribed for conditions such as respiratory infections, urinary tract infections, and skin infections. Amoxicillin is a widely used and effective antibiotic that helps in fighting various bacterial illnesses.",
        "id": "e12ca8df76c",
        "price": "Rs. 90",
        "prevPrice": "Rs. 120",
        "dosage": "250-500 mg every 8 hours",
        "side_effects": [
            "Nausea",
            "Diarrhea",
            "Skin rash",
            "Allergic reactions",
            "Yeast infections (in some cases)"
        ]
    },
    {
        "name": "Diclofenac",
        "description": "Diclofenac is a nonsteroidal anti-inflammatory drug (NSAID) that is used to relieve pain and reduce inflammation. It works by inhibiting the production of certain chemicals in the body that cause pain and swelling. Diclofenac is commonly prescribed to treat conditions such as arthritis, back pain, sprains, and strains.",
        "id": "2fe765ab89c",
        "price": "Rs. 55",
        "prevPrice": "Rs. 80",
        "dosage": "50-75 mg twice daily as needed",
        "side_effects": ["Nausea", "Stomach pain", "Indigestion", "Rash", "Allergic reactions"]
    },
    {
        "name": "Alprazolam",
        "description": "Alprazolam belongs to a class of drugs known as benzodiazepines, which act on the central nervous system to produce a calming effect. It is commonly prescribed to treat anxiety and panic disorders. Alprazolam helps in reducing excessive nervousness and promotes relaxation.",
        "id": "7cbef98a765",
        "price": "Rs. 80",
        "prevPrice": "Rs. 110",
        "dosage": "0.25-2 mg per day, divided into multiple doses",
        "side_effects": [
            "Drowsiness",
            "Dizziness",
            "Headache",
            "Memory problems",
            "Allergic reactions"
        ]
    },
    {
        "name": "Montelukast",
        "description": "Montelukast is a leukotriene receptor antagonist that is used to manage and prevent symptoms of asthma and seasonal allergies. It works by blocking the action of leukotrienes, which cause inflammation and bronchoconstriction in the airways. Montelukast provides relief from wheezing, shortness of breath, and allergic rhinitis.",
        "id": "8cdab12ef6a",
        "price": "Rs. 65",
        "prevPrice": "Rs. 95",
        "dosage": "10 mg once daily in the evening",
        "side_effects": ["Headache", "Abdominal pain", "Nausea", "Rash", "Allergic reactions"]
    },
    {
        "name": "Esomeprazole",
        "description": "Esomeprazole is a proton pump inhibitor (PPI) that is used to reduce the production of stomach acid. It is prescribed to treat conditions such as acid reflux, gastroesophageal reflux disease (GERD), and peptic ulcers. Esomeprazole provides relief from heartburn and helps in healing the esophagus.",
        "id": "f7bc98a9d34",
        "price": "Rs. 75",
        "prevPrice": "Rs. 105",
        "dosage": "20-40 mg once daily before a meal",
        "side_effects": ["Headache", "Nausea", "Diarrhea", "Abdominal pain", "Allergic reactions"]
    },
    {
        "name": "Metoprolol",
        "description": "Metoprolol is a beta-blocker that is used to treat high blood pressure, angina (chest pain), and heart rhythm disorders. It works by blocking the effects of adrenaline on the heart, thus reducing heart rate and blood pressure. Metoprolol is prescribed to improve heart function and prevent cardiovascular complications.",
        "id": "7b8f9a4dcba",
        "price": "Rs. 85",
        "prevPrice": "Rs. 115",
        "dosage": "25-200 mg per day, divided into multiple doses",
        "side_effects": [
            "Fatigue",
            "Dizziness",
            "Cold hands and feet",
            "Shortness of breath",
            "Allergic reactions"
        ]
    },
    {
        "name": "Ciprofloxacin",
        "description": "Ciprofloxacin is an antibiotic that belongs to the class of fluoroquinolones. It is used to treat bacterial infections such as urinary tract infections, respiratory infections, and skin infections. Ciprofloxacin works by stopping the growth of bacteria and is effective against a wide range of bacteria.",
        "id": "d4bca879e56",
        "price": "Rs. 95",
        "prevPrice": "Rs. 130",
        "dosage": "250-750 mg twice daily",
        "side_effects": ["Nausea", "Diarrhea", "Abdominal pain", "Rash", "Allergic reactions"]
    },
    {
        "name": "Ranitidine",
        "description": "Ranitidine is an H2 blocker that is used to reduce the production of stomach acid. It is prescribed to treat conditions such as acid reflux, peptic ulcers, and gastroesophageal reflux disease (GERD). Ranitidine provides relief from heartburn and helps in the healing of ulcers.",
        "id": "9abc1e45672",
        "price": "Rs. 70",
        "prevPrice": "Rs. 100",
        "dosage": "150 mg twice daily before a meal",
        "side_effects": ["Headache", "Nausea", "Diarrhea", "Dizziness", "Allergic reactions"]
    },
    {
        "name": "Fluoxetine",
        "description": "Fluoxetine is a selective serotonin reuptake inhibitor (SSRI) that is used to treat depression, obsessive-compulsive disorder (OCD), and panic disorder. It works by increasing the levels of serotonin, a neurotransmitter that regulates mood and emotions, in the brain. Fluoxetine helps in improving mood and reducing anxiety.",
        "id": "67ab89cdeff",
        "price": "Rs. 100",
        "prevPrice": "Rs. 140",
        "dosage": "20-80 mg per day, usually taken in the morning",
        "side_effects": [
            "Nausea",
            "Insomnia",
            "Headache",
            "Sexual dysfunction",
            "Allergic reactions"
        ]
    },
    {
        "name": "Furosemide",
        "description": "Furosemide is a diuretic medication used to treat fluid retention (edema) caused by various medical conditions such as congestive heart failure, kidney disorders, and liver disease. It works by increasing the amount of urine produced, thus reducing excess fluid in the body.",
        "id": "abc34556deff",
        "price": "Rs. 45",
        "prevPrice": "Rs. 70",
        "dosage": "20-80 mg once or twice daily",
        "side_effects": [
            "Frequent urination",
            "Low blood pressure",
            "Dizziness",
            "Muscle cramps",
            "Allergic reactions"
        ]
    },
    {
        "name": "Levothyroxine",
        "description": "Levothyroxine is a synthetic thyroid hormone used to treat hypothyroidism (underactive thyroid). It works by supplementing the body with the thyroid hormone it lacks. Levothyroxine helps in regulating metabolism and energy levels and is crucial for overall well-being.",
        "id": "f1bebc098ed",
        "price": "Rs. 110",
        "prevPrice": "Rs. 160",
        "dosage": "25-200 mcg once daily, preferably in the morning",
        "side_effects": [
            "Nervousness",
            "Weight loss (in excessive doses)",
            "Tremors",
            "Palpitations",
            "Allergic reactions"
        ]
    }
]
